
MAIN_URL = 'https://qa-scooter.praktikum-services.ru/'


answer_for_question = {
    0: 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
    1: 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
    2: 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
    3: 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
    4: 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
    5: 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
    6: 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
    7: 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
}


CUSTOMER_1 = {
    'name': 'Иван', 'surname': 'Светлый', 'phone': '89457656565',
    'address': 'улица Московская', 'metro': 'Черкизовская'
}
CUSTOMER_2 = {
    'name': 'Галина', 'surname': 'Смирнова', 'phone': '89312348888',
    'address': 'Старый арбат, 24',
    'metro': 'Университет'
}
RENT_1 = {
    'date': '23.08.2026', 'days': 'сутки', 'color': 'black', 'comment': 'Позвоните за час'
}
RENT_2 = {
    'date': '30.08.2026', 'days': 'трое суток', 'color': 'grey',
    'comment': 'Без опоздания!'}